In [2]:
import pandas as pd
import numpy as np

In [5]:
df=pd.read_csv('US Monthly Air Passengers.csv')

In [6]:
df.head()

,Sum_PASSENGERS,AIRLINE_ID,CARRIER_NAME,ORIGIN,ORIGIN_CITY_NAME,ORIGIN_STATE_ABR,ORIGIN_STATE_NM,ORIGIN_COUNTRY,ORIGIN_COUNTRY_NAME,DEST,DEST_CITY_NAME,DEST_STATE_ABR,DEST_STATE_NM,DEST_COUNTRY,DEST_COUNTRY_NAME,YEAR,MONTH
0,0,NaN,NaN,AEX,"Alexandria, LA",LA,Louisiana,US,United States,AEX,"Alexandria, LA",LA,Louisiana,US,United States,2015,3
1,0,NaN,NaN,AEX,"Alexandria, LA",LA,Louisiana,US,United States,AFW,"Dallas/Fort Worth, TX",TX,Texas,US,United States,2015,4
2,0,NaN,NaN,AEX,"Alexandria, LA",LA,Louisiana,US,United States,ATL,"Atlanta, GA",GA,Georgia,US,United States,2015,3
3,89,NaN,NaN,AEX,"Alexandria, LA",LA,Louisiana,US,United States,BOG,"Bogota, Colombia",NaN,NaN,CO,Colombia,2015,1
4,108,NaN,NaN,AEX,"Alexandria, LA",LA,Louisiana,US,United States,BOG,"Bogota, Colombia",NaN,NaN,CO,Colombia,2015,3

In [7]:
df.describe()

       Sum_PASSENGERS    AIRLINE_ID          YEAR         MONTH
count    6.278820e+06  6.278372e+06  6.278820e+06  6.278820e+06
mean     2.701670e+03  2.011377e+04  2.010136e+03  6.487506e+00
std      5.767481e+03  4.396388e+02  5.745520e+00  3.460352e+00
min      0.000000e+00  1.938500e+04  2.000000e+03  1.000000e+00
25%      6.000000e+00  1.980500e+04  2.005000e+03  3.000000e+00
50%      2.270000e+02  2.022500e+04  2.010000e+03  6.000000e+00
75%      3.026000e+03  2.037400e+04  2.015000e+03  9.000000e+00
max      1.637640e+05  2.207400e+04  2.020000e+03  1.200000e+01

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6278820 entries, 0 to 6278819
Data columns (total 17 columns):
 #   Column               Dtype
---  ------               -----
 0   Sum_PASSENGERS       int64
 1   AIRLINE_ID           float64
 2   CARRIER_NAME         object
 3   ORIGIN               object
 4   ORIGIN_CITY_NAME     object
 5   ORIGIN_STATE_ABR     object
 6   ORIGIN_STATE_NM      object
 7   ORIGIN_COUNTRY       object
 8   ORIGIN_COUNTRY_NAME  object
 9   DEST                 object
 10  DEST_CITY_NAME       object
 11  DEST_STATE_ABR       object
 12  DEST_STATE_NM        object
 13  DEST_COUNTRY         object
 14  DEST_COUNTRY_NAME    object
 15  YEAR                 int64
 16  MONTH                int64
dtypes: float64(1), int64(3), object(13)
memory usage: 814.4+ MB

In [10]:
df.isnull().sum()

Sum_PASSENGERS              0
AIRLINE_ID                448
CARRIER_NAME              448
ORIGIN                      0
ORIGIN_CITY_NAME            0
ORIGIN_STATE_ABR       561441
ORIGIN_STATE_NM        561441
ORIGIN_COUNTRY              2
ORIGIN_COUNTRY_NAME         0
DEST                        0
DEST_CITY_NAME              0
DEST_STATE_ABR         589465
DEST_STATE_NM          589465
DEST_COUNTRY                7
DEST_COUNTRY_NAME           0
YEAR                        0
MONTH                       0
dtype: int64

In [11]:
df['CARRIER_NAME'].fillna("No carrier name", inplace = True)

In [12]:
df['CARRIER_NAME'].isnull().sum()

0

In [13]:
(df['ORIGIN_COUNTRY']).value_counts()

US    5599883
CA     117496
MX     111889
GB      31953
JP      28182
       ...
AM          1
KV          1
TD          1
MZ          1
CD          1
Name: ORIGIN_COUNTRY, Length: 198, dtype: int64

In [14]:
df['ORIGIN_COUNTRY'].fillna("US", inplace = True )

In [15]:
df['ORIGIN_COUNTRY'].isnull().sum()

0

In [16]:
(df['DEST_COUNTRY']).value_counts()

US    5571449
CA     117906
MX     115534
GB      33718
JP      29037
       ...
ME          2
BY          1
SH          1
MU          1
YU          1
Name: DEST_COUNTRY, Length: 207, dtype: int64

In [17]:
df['DEST_COUNTRY'].fillna("US", inplace=True)

In [18]:
(df['DEST_COUNTRY']).isnull().sum()

0

In [19]:
df.drop(columns=['AIRLINE_ID', 'ORIGIN_STATE_ABR', 'ORIGIN_STATE_NM', 'DEST_STATE_ABR', 'DEST_STATE_NM'], inplace=True)

In [20]:
df.isnull().sum()

Sum_PASSENGERS         0
CARRIER_NAME           0
ORIGIN                 0
ORIGIN_CITY_NAME       0
ORIGIN_COUNTRY         0
ORIGIN_COUNTRY_NAME    0
DEST                   0
DEST_CITY_NAME         0
DEST_COUNTRY           0
DEST_COUNTRY_NAME      0
YEAR                   0
MONTH                  0
dtype: int64

In [21]:
df['DATE']= df['MONTH'].apply(str)+' '+df['YEAR'].apply(str) 
df.head()

,Sum_PASSENGERS,CARRIER_NAME,ORIGIN,ORIGIN_CITY_NAME,ORIGIN_COUNTRY,ORIGIN_COUNTRY_NAME,DEST,DEST_CITY_NAME,DEST_COUNTRY,DEST_COUNTRY_NAME,YEAR,MONTH,DATE
0,0,No carrier name,AEX,"Alexandria, LA",US,United States,AEX,"Alexandria, LA",US,United States,2015,3,3 2015
1,0,No carrier name,AEX,"Alexandria, LA",US,United States,AFW,"Dallas/Fort Worth, TX",US,United States,2015,4,4 2015
2,0,No carrier name,AEX,"Alexandria, LA",US,United States,ATL,"Atlanta, GA",US,United States,2015,3,3 2015
3,89,No carrier name,AEX,"Alexandria, LA",US,United States,BOG,"Bogota, Colombia",CO,Colombia,2015,1,1 2015
4,108,No carrier name,AEX,"Alexandria, LA",US,United States,BOG,"Bogota, Colombia",CO,Colombia,2015,3,3 2015

In [22]:
df.to_csv("passenger_data_clean.csv")